<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Dept;
use Illuminate\Support\Facades\DB;

class DeptSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    { 
        DB::table('depts')->delete();
        $depts = [
           
            ['name' => 'علوم حاسوب','faculty_id'=>'1'], 
            ['name' => 'تقانة المعلومات','faculty_id'=>'1'],
            ['name' => 'نظم المعلومات المحاسبية','faculty_id'=>'1'],
            ['name' => 'نظم المعلومات الإدارية','faculty_id'=>'1'],
            ['name' => 'نظم معلومات المكتبات','faculty_id'=>'1'],
            ['name' => 'هندسة برمجيات','faculty_id'=>'1'],


            ['name' => 'اللغة الفرنسية','faculty_id'=>'2'],
            ['name' => 'الآثار','faculty_id'=>'2'],
            ['name' => 'الفلسفة','faculty_id'=>'2'],
            ['name' => 'المكتبات والمعلومات ','faculty_id'=>'2'],
            ['name' => 'الجغرافيا','faculty_id'=>'2'],
            ['name' => 'اللغة العربية','faculty_id'=>'2'],
            ['name' => 'التاريخ','faculty_id'=>'2'],
            ['name' => 'علم النفس','faculty_id'=>'2'],
            ['name' => 'الدراسات اسلامية','faculty_id'=>'2'],
            ['name' => 'اللغة انجليزية','faculty_id'=>'2'],

            ['name' => 'الاحياء الدقيقـة و الاحياء الجزيئية','faculty_id'=>'11'],
            ['name' => 'الكيمياء','faculty_id'=>'11'],
            ['name' => 'الكيمياء الحيوية و الاحياء الجزيئية','faculty_id'=>'11'],
            ['name' => 'تكنولوجيا كيميائية','faculty_id'=>'11'],
            ['name' => 'رياضيات و حاسوب','faculty_id'=>'11'],
            ['name' => 'احصاء و حاسوب','faculty_id'=>'11'],
            ['name' => 'الفيزياء الطبية و الحيوية','faculty_id'=>'11'],
            ['name' => 'الفيزياء','faculty_id'=>'11'],
            ['name' => 'الطاقات المتجددة و الليزر','faculty_id'=>'11'],
            ['name' => 'فيزياء الكترونيات و حوسبة الفيزيائية','faculty_id'=>'11'],
            ['name' => ' الاحياء والتقنيات الاحيائية-الاحياء','faculty_id'=>'11'],
            ['name' => 'العلوم البيئية','faculty_id'=>'11'],
            ['name' => 'حشرات و طفيليات','faculty_id'=>'11'],

            
            ['name' => 'إنتاج حيواني','faculty_id'=>'13'],
            ['name' => 'هندسة زراعية','faculty_id'=>'13'],
            ['name' => 'علوم اسماك','faculty_id'=>'13'],
            ['name' => 'تقانة أغذية','faculty_id'=>'13'],

            ['name' => 'الاحصاء التطبيقي و الاكشواري','faculty_id'=>'12'],
            ['name' => 'تقنية المعلومات','faculty_id'=>'12'],
            ['name' => 'دراسات سكانية','faculty_id'=>'12'],
            ['name' => 'علم الاكشواري','faculty_id'=>'12'],
            ['name' => 'تطبيقات و حوسبة احصائية','faculty_id'=>'12'],
            ['name' => 'العلوم الرياضية','faculty_id'=>'12'],
            ['name' => 'نمذجة و حوسبة رياضية','faculty_id'=>'12'],
            ['name' => 'العلوم الرياضية القسم العام','faculty_id'=>'12'],
            ['name' => 'الاحصاء و الاكشواري القسم العام','faculty_id'=>'12'],
            ['name' => 'رياضيات صناعية','faculty_id'=>'12'],
            
            ['name' => 'التأمين','faculty_id'=>'10'],
            ['name' => 'إدارة أعمال','faculty_id'=>'10'],

            ['name' => 'الاقتصاد','faculty_id'=>'17'],
            ['name' => 'الانثربولجي','faculty_id'=>'17'],
            ['name' => 'الاجتماع','faculty_id'=>'17'],
            ['name' => 'المحاسبة','faculty_id'=>'10'],
            ['name' => 'علوم سياسية','faculty_id'=>'17'],
            ['name' => 'خدمة اجتماعية','faculty_id'=>'17'],

            ['name' => 'قانون القسم العام','faculty_id'=>'3'],
            ['name' => 'تشريع ضريبي','faculty_id'=>'3'],

            ['name' => 'هندسة القسم العام','faculty_id'=>'6'],
            ['name' => 'هندسة اتصالات','faculty_id'=>'6'],
            ['name' => 'هندسة تحكم','faculty_id'=>'6'],
            ['name' => 'هندسة كيمائية','faculty_id'=>'6'],

            ['name' => 'تربية رياضية','faculty_id'=>'8'],
            ['name' => 'دراما','faculty_id'=>'8'],

            ['name' => 'علوم البصريات','faculty_id'=>'7'],
            ['name' => 'مختبرات القسم العام','faculty_id'=>'9'],
            ['name' => 'الطب','faculty_id'=>'5'],
            ['name' => 'طب الاسنان','faculty_id'=>'16'],
            ['name' => 'التمريض','faculty_id'=>'18'],

            ['name' => 'القسم العـام','faculty_id'=>'19'],
            ['name' => 'قسم الصيدلة','faculty_id'=>'4'],
            ['name' => 'هندسة حاسوب','faculty_id'=>'6'],

            ['name' => 'جيولوجيا البترول ','faculty_id'=>'14'],
            ['name' => 'الجيولوجيا','faculty_id'=>'14'],
            ['name' => 'جيولوجيا المياه','faculty_id'=>'14'],
            ['name' => 'الثروات المعدنية','faculty_id'=>'14'],

            ['name' => 'هندسة اتصالات-مركز العمارات','faculty_id'=>'6'],
            ['name' => 'هندسة حاسوب-مركز العمارات','faculty_id'=>'6'],
            ['name' => 'هندسة كهرباء-مركز العمارات','faculty_id'=>'6'],

            ['name' => 'الكيمياء السريرية','faculty_id'=>'9'],
            ['name' => 'امراض الدم','faculty_id'=>'9'],
            ['name' => 'الاحياء الدقيقة','faculty_id'=>'9'],
            ['name' => 'الانسجة المريضة','faculty_id'=>'9'],
            ['name' => 'الطفيليات','faculty_id'=>'9'],

            ['name' => 'تقانة المعلومات -مركز الحرية','faculty_id'=>'1'],
            ['name' => 'هندسة برمجيات- مركز الحرية','faculty_id'=>'1'],
            ['name' => 'نظم معلومات - مركز الحرية','faculty_id'=>'1'],

            ['name' => 'تقنية الاجهزة والمعامل','faculty_id'=>'11'],
            ['name' => 'تكنلوجيا الكترونيات','faculty_id'=>'11'],


            ['name' => 'الوسائل البصرية','faculty_id'=>'7'],
            ['name' => 'تقانة العيون','faculty_id'=>'7'],

            ['name' => 'نظم معلومات - مركز جبرة','faculty_id'=>'1'],
            ['name' => 'تقانة معلومات - مركز جبرة','faculty_id'=>'1'],

            ['name' => 'الرياضيات','faculty_id'=>'12'],
            ['name' => 'الاحصاء والحوسبة','faculty_id'=>'12'],
            ['name' => 'الجيوفيزياء','faculty_id'=>'14'],
            ['name' => 'هندسة كهرباء','faculty_id'=>'6'],

            ['name' => 'اداب - علم نفس','faculty_id'=>'15'],
            ['name' => 'اداب - تاريخ','faculty_id'=>'15'],
            ['name' => 'اداب - جغرافيا','faculty_id'=>'15'],
            ['name' => 'اداب - دراسات اسلامية','faculty_id'=>'15'],
            ['name' => 'اداب - لغة عربية','faculty_id'=>'15'],
            ['name' => 'اداب - لغة انجليزية','faculty_id'=>'15'],
            ['name' => 'اداب - مكتبات ومعلومات','faculty_id'=>'15'],
            ['name' => 'اداب - فلسفة','faculty_id'=>'15'],
            ['name' => 'تجارة _ MBA  ','faculty_id'=>'15'],
           
            ['name' => 'قانون  - عام','faculty_id'=>'3'],
            ['name' => 'قانون - خاص','faculty_id'=>'3'],
            ['name' => 'قانون - تجاري','faculty_id'=>'3'],
            ['name' => 'قانون - مدني','faculty_id'=>'3'],
            ['name' => 'قانون - جنائي','faculty_id'=>'3'],
            ['name' => 'قانون - دولي','faculty_id'=>'3'],


            ['name' => 'القسـم العام','faculty_id'=>'8'],

            ['name' => 'تجارة - ادارة اعمال','faculty_id'=>'15'],
            ['name' => 'تجارة - اقتصاد','faculty_id'=>'15'],
            ['name' => 'تجارة - تأمين','faculty_id'=>'15'],
            ['name' => 'تجارة - تنمية اقتصادية','faculty_id'=>'15'],
            ['name' => 'تنمية مجتمع','faculty_id'=>'17'],
            ['name' => 'تجارة -محاسبة','faculty_id'=>'15'],
            ['name' => 'حاسوب - علوم حاسوب','faculty_id'=>'15'],
            ['name' => 'حاسوب - تقانة معلومات','faculty_id'=>'15'],
            ['name' => 'حاسوب - نظم معلومات','faculty_id'=>'15'],
            ['name' => 'تجارة - علوم سياسية','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة - تكنلوجيا كيميائية','faculty_id'=>'15'],
            ['name' => 'هندسة البرمجيات','faculty_id'=>'6'],




            ['name' => 'البصريات-تخصص البصريات','faculty_id'=>'15'],
            ['name' => 'تجارة - اجتماع','faculty_id'=>'15'],
            ['name' => 'تجارة -طب المجتمع','faculty_id'=>'15'],
            ['name' => 'تجارة -صحة المجتمع','faculty_id'=>'15'],

            ['name' => 'علم المجتمع','faculty_id'=>'17'],
            ['name' => 'اقتصاد زراعي','faculty_id'=>'17'],

            ['name' => 'الطب-تخصص طب','faculty_id'=>'15'],
            ['name' => 'الطب-تخصص طب اسنان','faculty_id'=>'15'],

            ['name' => 'احياء دقيقه','faculty_id'=>'5'],
            ['name' => 'تشريح','faculty_id'=>'5'],

            ['name' => 'احصاء','faculty_id'=>'12'],
            ['name' => 'احصاء رياضي','faculty_id'=>'12'],

            ['name' => 'احصاء و رياضيات- الرياضيات','faculty_id'=>'15'],
            ['name' => 'الرياضيات التطبيقية','faculty_id'=>'12'],
            ['name' => 'العلوم و التقانة-احياء دقيقة','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة-احياء عامة','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة-احياء','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة-كيمياء','faculty_id'=>'11'],
            ['name' => 'كيمياء حيوية','faculty_id'=>'11'],
            ['name' => 'العلوم و التقانة-تكنولوجيا كيمياء','faculty_id'=>'15'],
            ['name' => 'جيوكيمياء','faculty_id'=>'11'],
            ['name' => 'العلوم و التقانة-جيولوجيا','faculty_id'=>'15'],

            ['name' => 'كيمياء تحليلية','faculty_id'=>'11'],
            ['name' => 'كيمياء تطبيقية','faculty_id'=>'11'],
            ['name' => 'العلوم و التقانة-كيمياء سريرية','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة-فيزياء','faculty_id'=>'15'],
            ['name' => 'فيزياء حيوية','faculty_id'=>'11'],
            ['name' => 'فيزياء طبية','faculty_id'=>'11'],
            ['name' => 'زراعة-هندسة زراعية','faculty_id'=>'15'],

            ['name' => 'استزراع سمكي','faculty_id'=>'13'],
            ['name' => 'زراعة-انتاج حيواني','faculty_id'=>'15'],
            ['name' => 'تغذية و دواجن','faculty_id'=>'13'],
            ['name' => 'زراعة-علوم اسماك','faculty_id'=>'15'],
            ['name' => 'نظم معلومات زراعية','faculty_id'=>'13'],
            ['name' => 'مختبرات-مختبرات','faculty_id'=>'15'],

            ['name' => 'مختبرات-المناعة','faculty_id'=>'15'],
            ['name' => 'مختبرات-امراض الدم','faculty_id'=>'15'],
            ['name' => 'مختبرات-انسجة مريضة','faculty_id'=>'15'],
            ['name' => 'مختبرات-تجلط الدم','faculty_id'=>'15'],
            ['name' => 'مختبرات-وظائف اعضاء','faculty_id'=>'15'],
            ['name' => 'هندسة-اتصالات','faculty_id'=>'15'],
            ['name' => 'هندسة-تحكم','faculty_id'=>'15'],
            ['name' => 'هندسة-حاسوب','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة- الجيوفيزياء','faculty_id'=>'15'],
            ['name' => 'طب ونقل دم','faculty_id'=>'9'],

            ['name' => 'تجارة-دبلوماسي','faculty_id'=>'15'],
            ['name' => 'مركز حوار الحضارات','faculty_id'=>'2'],

            ['name' => 'احصاء و رياضيات- احصاء اكشواري','faculty_id'=>'15'],
            ['name' => 'مختبرات-الطفيليات','faculty_id'=>'15'],
            ['name' => 'التعليم عن بعد','faculty_id'=>'8'],
            ['name' => 'محاسبة','faculty_id'=>'15'],

            ['name' => 'علوم حاسوب - مركز الحرية','faculty_id'=>'1'],
            ['name' => 'نظم معلومات','faculty_id'=>'1'],
            ['name' => 'تجارة - خدمة اجتماعية','faculty_id'=>'15'],
            ['name' => 'العلوم و التقانة-الكيمياء','faculty_id'=>'15'],

            ['name' => 'هندسة','faculty_id'=>'15'],
            ['name' => 'MBA','faculty_id'=>'10'],

            ['name' => 'التنمية الاقتصادية','faculty_id'=>'17'],
            ['name' => 'جيو كيمياء','faculty_id'=>'14'],
            ['name' => 'الأنظمة المتضمنة','faculty_id'=>'6'],
            ['name' => 'شبكات البيانات والاتصالات','faculty_id'=>'6'],

            ['name' => 'المحاصيل الحقلية و البستانية','faculty_id'=>'13'],
            ['name' => 'المراعي و الأعلاف','faculty_id'=>'13'],

            ['name' => 'مركز ابحاث ودراسات حوض النيل','faculty_id'=>'2'],
            ['name' => 'الاحصاء والديموغرافيا','faculty_id'=>'12'],

            ['name' => 'الاحياء والتقنيات الاحيائية-التقنيات الاحيائية','faculty_id'=>'11'],
            ['name' => 'تقنية معامل الكيمياء','faculty_id'=>'11'],
            ['name' => 'الاحياء  والدراسات البيئية','faculty_id'=>'11'],

            ['name' => 'التمريض الباطني الجراحي','faculty_id'=>'18'],
            ['name' => 'التوليد وامراض النساء','faculty_id'=>'18'],
            ['name' => 'تمريض الاطفال','faculty_id'=>'18'],
            ['name' => 'صحة المجتمع','faculty_id'=>'18'],

            ['name' => ' العلاج الطبيعي','faculty_id'=>'19'],

            ['name' => 'منهجية واخلاقيات البحوث الصحية','faculty_id'=>'5'],
            ['name' => 'الصحة العامة','faculty_id'=>'5'],
            ['name' => 'وظائف الاعضاء','faculty_id'=>'5'],

            ['name' => 'اقتصادزراعى وتنمية ريفية','faculty_id'=>'13'],
            ['name' => 'التربة واستصلاح الاراضى','faculty_id'=>'13'],

            ['name' => 'الريـاضيات','faculty_id'=>'8'],

            ['name' => 'السياحة','faculty_id'=>'20'],
            ['name' => 'الفنادق','faculty_id'=>'20'],
            ['name' => 'التعليم قبل المدرسي','faculty_id'=>'20'],

            ['name' => 'M.S.C','faculty_id'=>'10'],
            ['name' => 'وقاية النباتات','faculty_id'=>'13'],
            ['name' => 'DBA','faculty_id'=>'10'],

            ['name' => 'الاحياء الجزيئية','faculty_id'=>'5'],
            ['name' => 'طب المجتمع','faculty_id'=>'5'],
            ['name' => 'ادارة اعمال -تسويق ومبيعات','faculty_id'=>'10'],
            ['name' => 'ادارة اعمال -مشتريات ومحازن','faculty_id'=>'10'],

            ['name' => 'تطبيقات الاستشعار عن بعد ونظم المعلومات الجغرافية ','faculty_id'=>'14'],
            ['name' => 'جيولوجيا هندسية','faculty_id'=>'14'],

            ['name' => 'التنمية الريفية','faculty_id'=>'20'],
            ['name' => 'طب متخصص','faculty_id'=>'5'],
            ['name' => 'الشعبة العامة','faculty_id'=>'2'],

            ['name' => 'مجال واعصاب الرؤية','faculty_id'=>'7'],
            ['name' => 'التصوير الطبي','faculty_id'=>'7'],
            ['name' => 'تقويم البصر','faculty_id'=>'7'],
            ['name' => 'العدسات اللاصقة','faculty_id'=>'7'],
            ['name' => 'الابصار المتدني','faculty_id'=>'7'],

            ['name' => 'الشـعبة العامة','faculty_id'=>'17'],

            ['name' => 'الـشعبة العامة(احياء)','faculty_id'=>'11'],
            ['name' => 'الـشعبة العامة(فيزياء)','faculty_id'=>'11'],

            ['name' => 'الـشعبة العامة','faculty_id'=>'14'],
            ['name' => 'الـشـعبة العامة','faculty_id'=>'22'],
            ['name' => 'الطب الجزيئي','faculty_id'=>'21'],
            ['name' => 'انظمة نقالة','faculty_id'=>'6'],

            ['name' => 'الكيمياء الحيويـة','faculty_id'=>'5'],
            ['name' => 'الشعـبة العامة','faculty_id'=>'10'],
            ['name' => 'القوانيين','faculty_id'=>'3'],

            ['name' => 'الاطراف الصناعية','faculty_id'=>'19'],
            ['name' => 'التعليم الطبي','faculty_id'=>'5'],
            ['name' => 'الشعـبة  العامة','faculty_id'=>'13'],

            ['name' => 'الادارة العامة','faculty_id'=>'17'],
            ['name' => 'الدراسات الاستراتيجية','faculty_id'=>'17'],
            ['name' => ' العلاقات الدولية','faculty_id'=>'17'],

            ['name' => 'التلوين','faculty_id'=>'22'],
            ['name' => 'التصميم الداخلي','faculty_id'=>'22'],

            ['name' => 'الدراسات الإسلامية - القسم العام','faculty_id'=>'23'],
            ['name' => ' تطبيقات الاستشعار عن بعد ونظم المعلومات الجغرافية','faculty_id'=>'2'],
            ['name' => 'الربو الشعبي','faculty_id'=>'5'],

            ['name' => 'الاحـياء الـجزيئية','faculty_id'=>'24'],
            ['name' => 'الشعبة العامة لغات','faculty_id'=>'2'],
            ['name' => 'الدراسات الانسانية','faculty_id'=>'2'],

            ['name' => 'الشعبة العامة (كيمياء)','faculty_id'=>'11'],
            ['name' => 'الجينات','faculty_id'=>'24'],
            ['name' => 'تقنية الخلايا الجزعية','faculty_id'=>'24'],

           // ['name' => 'تجريب','faculty_id'=>'26'],
            ['name' => 'الصحة العامة - مركز فيوتشر','faculty_id'=>'5'],

            /*
            ['name' => '','faculty_id'=>'13'],
            ['name' => '','faculty_id'=>'13'],
            ['name' => '','faculty_id'=>'13'],
            ['name' => '','faculty_id'=>'13'],
            ['name' => '','faculty_id'=>'13'],
            ['name' => '','faculty_id'=>'13'],

            */


            
          
            ];
    
            foreach ($depts as $key => $value) {
    
                Dept::create($value);
    
            }

    }






}
